{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": false
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "</w>",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "-": 1,
      ".": 2,
      "0": 3,
      "1": 4,
      "2": 5,
      "3": 6,
      "4": 7,
      "5": 8,
      "6": 9,
      "7": 10,
      "8": 11,
      "9": 12,
      ";": 13,
      "A": 14,
      "F": 15,
      "G": 16,
      "S": 17,
      "X": 18,
      "Y": 19,
      "b": 20,
      "e": 21,
      "g": 22,
      "i": 23,
      "l": 24,
      "m": 25,
      "n": 26,
      "o": 27,
      "p": 28,
      "r": 29,
      "s": 30,
      "t": 31,
      "u": 32,
      "7</w>": 33,
      "8</w>": 34,
      "6</w>": 35,
      "3</w>": 36,
      "4</w>": 37,
      "9</w>": 38,
      "0</w>": 39,
      "5</w>": 40,
      "1</w>": 41,
      "2</w>": 42,
      "Y</w>": 43,
      "t</w>": 44,
      "X</w>": 45,
      "e</w>": 46,
      ".</w>": 47,
      "o</w>": 48,
      "s</w>": 49,
      "-</w>": 50,
      ";</w>": 51,
      "g</w>": 52,
      "00</w>": 53,
      "12": 54,
      "F12": 55,
      "G1</w>": 56,
      "F1200</w>": 57,
      "Y3</w>": 58,
      "X3</w>": 59,
      "Y4</w>": 60,
      "X2</w>": 61,
      "it": 62,
      "X4</w>": 63,
      "Y2</w>": 64,
      "21</w>": 65,
      "90</w>": 66,
      "Ab": 67,
      "G21</w>": 68,
      "G90</w>": 69,
      "Se": 70,
      "er": 71,
      "et": 72,
      "il": 73,
      "im": 74,
      "in": 75,
      "io": 76,
      "lu": 77,
      "lim": 78,
      "mil": 79,
      "nit": 80,
      "nin": 81,
      "os": 82,
      "olu": 83,
      "pos": 84,
      "solu": 85,
      "te</w>": 86,
      "to</w>": 87,
      "unit": 88,
      "itio": 89,
      "Absolu": 90,
      "Set</w>": 91,
      "ers</w>": 92,
      "eters</w>": 93,
      "limeters</w>": 94,
      "millimeters</w>": 95,
      "ning</w>": 96,
      "positio": 97,
      "units</w>": 98,
      "Absolute</w>": 99,
      "positioning</w>": 100,
      "X1": 101,
      "Y5</w>": 102,
      "X5</w>": 103,
      "X1</w>": 104,
      "68</w>": 105,
      "X2": 106,
      "99</w>": 107,
      "Y1": 108,
      "08": 109,
      "23": 110,
      "48": 111,
      "75": 112,
      "77": 113,
      "18": 114,
      "03": 115,
      "19</w>": 116,
      "78": 117,
      "93</w>": 118,
      "08</w>": 119,
      "34": 120,
      "57": 121,
      "85": 122,
      "04</w>": 123,
      "47": 124,
      "66</w>": 125,
      "87": 126,
      "05</w>": 127,
      "10</w>": 128,
      "24": 129,
      "63</w>": 130,
      "74": 131,
      "92</w>": 132,
      "07": 133,
      "14</w>": 134,
      "95": 135,
      "07</w>": 136,
      "17</w>": 137,
      "26</w>": 138,
      "23</w>": 139,
      "44": 140,
      "63": 141,
      "73": 142,
      "02</w>": 143,
      "12</w>": 144,
      "88": 145,
      "35": 146,
      "38": 147,
      "45": 148,
      "83": 149,
      "98</w>": 150,
      "13</w>": 151,
      "29</w>": 152,
      "93": 153,
      "91</w>": 154,
      "06</w>": 155,
      "14": 156,
      "15": 157,
      "17": 158,
      "15</w>": 159,
      "53": 160,
      "64": 161,
      "68": 162,
      "65</w>": 163,
      "84": 164,
      "98": 165,
      "97</w>": 166,
      "X10</w>": 167,
      "27": 168,
      "28": 169,
      "25</w>": 170,
      "22</w>": 171,
      "58": 172,
      "67</w>": 173,
      "60</w>": 174,
      "61</w>": 175,
      "03</w>": 176,
      "09</w>": 177,
      "16</w>": 178,
      "25": 179,
      "28</w>": 180,
      "55": 181,
      "96</w>": 182,
      "04": 183,
      "18</w>": 184,
      "27</w>": 185,
      "20</w>": 186,
      "33": 187,
      "54": 188,
      "65": 189,
      "97": 190,
      "13": 191,
      "11</w>": 192,
      "37": 193,
      "43": 194,
      "64</w>": 195,
      "69</w>": 196,
      "62</w>": 197,
      "05": 198,
      "94</w>": 199,
      "Y1</w>": 200,
      "X16</w>": 201,
      "X12</w>": 202,
      "24</w>": 203,
      "67": 204,
      "X7</w>": 205,
      "01</w>": 206,
      "X6</w>": 207,
      "Y6</w>": 208,
      "X11</w>": 209,
      "568</w>": 210,
      "95</w>": 211,
      "X9</w>": 212,
      "X21</w>": 213,
      "X13</w>": 214,
      "X15</w>": 215,
      "008</w>": 216,
      "X3": 217,
      "293</w>": 218,
      "94": 219,
      "X19</w>": 220,
      "X22</w>": 221,
      "478</w>": 222,
      "098</w>": 223,
      "210</w>": 224,
      "319</w>": 225,
      "593</w>": 226,
      "699</w>": 227,
      "X8</w>": 228,
      "Y0</w>": 229,
      "126</w>": 230,
      "X17</w>": 231,
      "X18</w>": 232,
      "X14</w>": 233,
      "X26</w>": 234,
      "Y13</w>": 235,
      "Y11</w>": 236,
      "Y12</w>": 237,
      "084</w>": 238,
      "483</w>": 239,
      "458</w>": 240,
      "450</w>": 241,
      "108</w>": 242,
      "114</w>": 243,
      "200</w>": 244,
      "292</w>": 245,
      "220</w>": 246,
      "368</w>": 247,
      "304</w>": 248,
      "302</w>": 249,
      "429</w>": 250,
      "691</w>": 251,
      "700</w>": 252,
      "768</w>": 253,
      "725</w>": 254,
      "899</w>": 255,
      "927</w>": 256,
      "087</w>": 257,
      "754</w>": 258,
      "770</w>": 259,
      "775</w>": 260,
      "186</w>": 261,
      "344</w>": 262,
      "341</w>": 263,
      "573</w>": 264,
      "570</w>": 265,
      "572</w>": 266,
      "853</w>": 267,
      "852</w>": 268,
      "874</w>": 269,
      "742</w>": 270,
      "073</w>": 271,
      "959</w>": 272,
      "448</w>": 273,
      "633</w>": 274,
      "883</w>": 275,
      "352</w>": 276,
      "836</w>": 277,
      "937</w>": 278,
      "684</w>": 279,
      "286</w>": 280,
      "584</w>": 281,
      "099</w>": 282,
      "066</w>": 283,
      "017</w>": 284,
      "022</w>": 285,
      "061</w>": 286,
      "100</w>": 287,
      "165</w>": 288,
      "205</w>": 289,
      "223</w>": 290,
      "216</w>": 291,
      "227</w>": 292,
      "269</w>": 293,
      "393</w>": 294,
      "326</w>": 295,
      "312</w>": 296,
      "361</w>": 297,
      "328</w>": 298,
      "405</w>": 299,
      "423</w>": 300,
      "402</w>": 301,
      "590</w>": 302,
      "563</w>": 303,
      "517</w>": 304,
      "512</w>": 305,
      "560</w>": 306,
      "666</w>": 307,
      "607</w>": 308,
      "602</w>": 309,
      "606</w>": 310,
      "793</w>": 311,
      "792</w>": 312,
      "707</w>": 313,
      "715</w>": 314,
      "800</w>": 315,
      "863</w>": 316,
      "829</w>": 317,
      "828</w>": 318,
      "811</w>": 319,
      "999</w>": 320,
      "904</w>": 321,
      "963</w>": 322,
      "914</w>": 323,
      "Y7</w>": 324,
      "Y8</w>": 325,
      "Y9</w>": 326,
      "128</w>": 327,
      "X27</w>": 328,
      "X24</w>": 329,
      "085</w>": 330,
      "238</w>": 331,
      "233</w>": 332,
      "230</w>": 333,
      "231</w>": 334,
      "488</w>": 335,
      "489</w>": 336,
      "758</w>": 337,
      "774</w>": 338,
      "771</w>": 339,
      "187</w>": 340,
      "185</w>": 341,
      "038</w>": 342,
      "034</w>": 343,
      "031</w>": 344,
      "787</w>": 345,
      "789</w>": 346,
      "346</w>": 347,
      "471</w>": 348,
      "879</w>": 349,
      "248</w>": 350,
      "249</w>": 351,
      "245</w>": 352,
      "745</w>": 353,
      "957</w>": 354,
      "956</w>": 355,
      "880</w>": 356,
      "358</w>": 357,
      "388</w>": 358,
      "389</w>": 359,
      "170</w>": 360,
      "535</w>": 361,
      "276</w>": 362,
      "281</w>": 363,
      "589</w>": 364,
      "255</w>": 365,
      "135</w>": 366,
      "670</w>": 367,
      "019</w>": 368,
      "026</w>": 369,
      "012</w>": 370,
      "097</w>": 371,
      "067</w>": 372,
      "009</w>": 373,
      "016</w>": 374,
      "001</w>": 375,
      "105</w>": 376,
      "110</w>": 377,
      "107</w>": 378,
      "106</w>": 379,
      "164</w>": 380,
      "299</w>": 381,
      "204</w>": 382,
      "266</w>": 383,
      "263</w>": 384,
      "214</w>": 385,
      "202</w>": 386,
      "298</w>": 387,
      "206</w>": 388,
      "215</w>": 389,
      "296</w>": 390,
      "262</w>": 391,
      "294</w>": 392,
      "295</w>": 393,
      "308</w>": 394,
      "392</w>": 395,
      "323</w>": 396,
      "468</w>": 397,
      "404</w>": 398,
      "466</w>": 399,
      "492</w>": 400,
      "417</w>": 401,
      "413</w>": 402,
      "491</w>": 403,
      "497</w>": 404,
      "424</w>": 405,
      "599</w>": 406,
      "519</w>": 407,
      "508</w>": 408,
      "523</w>": 409,
      "598</w>": 410,
      "565</w>": 411,
      "567</w>": 412,
      "503</w>": 413,
      "600</w>": 414,
      "663</w>": 415,
      "614</w>": 416,
      "665</w>": 417,
      "625</w>": 418,
      "660</w>": 419,
      "628</w>": 420,
      "719</w>": 421,
      "705</w>": 422,
      "710</w>": 423,
      "723</w>": 424,
      "722</w>": 425,
      "703</w>": 426,
      "718</w>": 427,
      "720</w>": 428,
      "762</w>": 429,
      "701</w>": 430,
      "868</w>": 431,
      "819</w>": 432,
      "804</w>": 433,
      "805</w>": 434,
      "814</w>": 435,
      "826</w>": 436,
      "897</w>": 437,
      "803</w>": 438,
      "820</w>": 439,
      "968</w>": 440,
      "919</w>": 441,
      "966</w>": 442,
      "905</w>": 443,
      "907</w>": 444,
      "917</w>": 445,
      "926</w>": 446,
      "929</w>": 447,
      "967</w>": 448,
      "909</w>": 449,
      "911</w>": 450,
      "Y21</w>": 451,
      "120</w>": 452,
      "X23</w>": 453,
      "Y15</w>": 454,
      "083</w>": 455,
      "089</w>": 456,
      "080</w>": 457,
      "236</w>": 458,
      "239</w>": 459,
      "487</w>": 460,
      "486</w>": 461,
      "485</w>": 462,
      "753</w>": 463,
      "750</w>": 464,
      "755</w>": 465,
      "751</w>": 466,
      "752</w>": 467,
      "773</w>": 468,
      "188</w>": 469,
      "184</w>": 470,
      "180</w>": 471,
      "182</w>": 472,
      "037</w>": 473,
      "033</w>": 474,
      "039</w>": 475,
      "783</w>": 476,
      "784</w>": 477,
      "781</w>": 478,
      "782</w>": 479,
      "340</w>": 480,
      "574</w>": 481,
      "856</w>": 482,
      "850</w>": 483,
      "851</w>": 484,
      "476</w>": 485,
      "474</w>": 486,
      "877</w>": 487,
      "876</w>": 488,
      "875</w>": 489,
      "243</w>": 490,
      "244</w>": 491,
      "240</w>": 492,
      "747</w>": 493,
      "744</w>": 494,
      "077</w>": 495,
      "079</w>": 496,
      "071</w>": 497,
      "072</w>": 498,
      "951</w>": 499,
      "447</w>": 500,
      "449</w>": 501,
      "445</w>": 502,
      "636</w>": 503,
      "630</w>": 504,
      "635</w>": 505,
      "737</w>": 506,
      "738</w>": 507,
      "739</w>": 508,
      "730</w>": 509,
      "735</w>": 510,
      "886</w>": 511,
      "353</w>": 512,
      "383</w>": 513,
      "380</w>": 514,
      "838</w>": 515,
      "833</w>": 516,
      "832</w>": 517,
      "935</w>": 518,
      "148</w>": 519,
      "144</w>": 520,
      "154</w>": 521,
      "152</w>": 522,
      "174</w>": 523,
      "536</w>": 524,
      "530</w>": 525,
      "646</w>": 526,
      "644</w>": 527,
      "649</w>": 528,
      "645</w>": 529,
      "686</w>": 530,
      "840</w>": 531,
      "845</w>": 532,
      "986</w>": 533,
      "989</w>": 534,
      "981</w>": 535,
      "273</w>": 536,
      "274</w>": 537,
      "279</w>": 538,
      "287</w>": 539,
      "258</w>": 540,
      "553</w>": 541,
      "559</w>": 542,
      "047</w>": 543,
      "040</w>": 544,
      "338</w>": 545,
      "331</w>": 546,
      "540</w>": 547,
      "653</w>": 548,
      "654</w>": 549,
      "652</w>": 550,
      "977</w>": 551,
      "978</w>": 552,
      "133</w>": 553,
      "377</w>": 554,
      "374</w>": 555,
      "432</w>": 556,
      "050</w>": 557,
      "676</w>": 558,
      "021</w>": 559,
      "090</w>": 560,
      "010</w>": 561,
      "007</w>": 562,
      "002</w>": 563,
      "013</w>": 564,
      "029</w>": 565,
      "006</w>": 566,
      "015</w>": 567,
      "003</w>": 568,
      "096</w>": 569,
      "018</w>": 570,
      "027</w>": 571,
      "069</w>": 572,
      "190</w>": 573,
      "193</w>": 574,
      "104</w>": 575,
      "166</w>": 576,
      "163</w>": 577,
      "192</w>": 578,
      "117</w>": 579,
      "198</w>": 580,
      "113</w>": 581,
      "191</w>": 582,
      "197</w>": 583,
      "160</w>": 584,
      "103</w>": 585,
      "109</w>": 586,
      "116</w>": 587,
      "118</w>": 588,
      "290</w>": 589,
      "219</w>": 590,
      "207</w>": 591,
      "226</w>": 592,
      "212</w>": 593,
      "213</w>": 594,
      "225</w>": 595,
      "222</w>": 596,
      "261</w>": 597,
      "209</w>": 598,
      "228</w>": 599,
      "300</w>": 600,
      "390</w>": 601,
      "399</w>": 602,
      "306</w>": 603,
      "360</w>": 604,
      "396</w>": 605,
      "324</w>": 606,
      "395</w>": 607,
      "421</w>": 608,
      "490</w>": 609,
      "499</w>": 610,
      "419</w>": 611,
      "410</w>": 612,
      "412</w>": 613,
      "465</w>": 614,
      "425</w>": 615,
      "460</w>": 616,
      "496</w>": 617,
      "464</w>": 618,
      "462</w>": 619,
      "494</w>": 620,
      "495</w>": 621,
      "500</w>": 622,
      "521</w>": 623,
      "566</w>": 624,
      "505</w>": 625,
      "592</w>": 626,
      "526</w>": 627,
      "529</w>": 628,
      "561</w>": 629,
      "509</w>": 630,
      "516</w>": 631,
      "528</w>": 632,
      "564</w>": 633,
      "668</w>": 634,
      "619</w>": 635,
      "610</w>": 636,
      "692</w>": 637,
      "626</w>": 638,
      "623</w>": 639,
      "613</w>": 640,
      "697</w>": 641,
      "662</w>": 642,
      "694</w>": 643,
      "695</w>": 644,
      "708</w>": 645,
      "704</w>": 646,
      "766</w>": 647,
      "763</w>": 648,
      "714</w>": 649,
      "717</w>": 650,
      "726</w>": 651,
      "713</w>": 652,
      "765</w>": 653,
      "797</w>": 654,
      "767</w>": 655,
      "761</w>": 656,
      "769</w>": 657,
      "794</w>": 658,
      "724</w>": 659,
      "807</w>": 660,
      "817</w>": 661,
      "823</w>": 662,
      "891</w>": 663,
      "825</w>": 664,
      "822</w>": 665,
      "896</w>": 666,
      "818</w>": 667,
      "864</w>": 668,
      "921</w>": 669,
      "993</w>": 670,
      "992</w>": 671,
      "902</w>": 672,
      "913</w>": 673,
      "991</w>": 674,
      "906</w>": 675,
      "915</w>": 676,
      "965</w>": 677,
      "997</w>": 678,
      "922</w>": 679,
      "960</w>": 680,
      "916</w>": 681,
      "996</w>": 682,
      "918</w>": 683,
      "Y22</w>": 684,
      "124</w>": 685,
      "129</w>": 686,
      "X28</w>": 687,
      "X29</w>": 688,
      "X20</w>": 689,
      "X25</w>": 690,
      "Y17</w>": 691,
      "Y16</w>": 692,
      "Y19</w>": 693,
      "Y10</w>": 694,
      "088</w>": 695,
      "086</w>": 696,
      "237</w>": 697,
      "235</w>": 698,
      "232</w>": 699,
      "480</w>": 700,
      "481</w>": 701,
      "757</w>": 702,
      "756</w>": 703,
      "778</w>": 704,
      "776</w>": 705,
      "772</w>": 706,
      "181</w>": 707,
      "036</w>": 708,
      "030</w>": 709,
      "788</w>": 710,
      "786</w>": 711,
      "785</w>": 712,
      "347</w>": 713,
      "343</w>": 714,
      "349</w>": 715,
      "578</w>": 716,
      "571</w>": 717,
      "854</w>": 718,
      "859</w>": 719,
      "855</w>": 720,
      "473</w>": 721,
      "479</w>": 722,
      "470</w>": 723,
      "873</w>": 724,
      "871</w>": 725,
      "872</w>": 726,
      "748</w>": 727,
      "746</w>": 728,
      "740</w>": 729,
      "078</w>": 730,
      "074</w>": 731,
      "954</w>": 732,
      "952</w>": 733,
      "446</w>": 734,
      "444</w>": 735,
      "441</w>": 736,
      "637</w>": 737,
      "631</w>": 738,
      "736</w>": 739,
      "733</w>": 740,
      "731</w>": 741,
      "887</w>": 742,
      "885</w>": 743,
      "881</w>": 744,
      "354</w>": 745,
      "351</w>": 746,
      "385</w>": 747,
      "382</w>": 748,
      "456</w>": 749,
      "830</w>": 750,
      "936</w>": 751,
      "934</w>": 752,
      "939</w>": 753,
      "930</w>": 754,
      "147</w>": 755,
      "149</w>": 756,
      "141</w>": 757,
      "142</w>": 758,
      "158</w>": 759,
      "156</w>": 760,
      "153</w>": 761,
      "159</w>": 762,
      "151</w>": 763,
      "178</w>": 764,
      "175</w>": 765,
      "171</w>": 766,
      "539</w>": 767,
      "532</w>": 768,
      "648</w>": 769,
      "642</w>": 770,
      "687</w>": 771,
      "680</w>": 772,
      "685</w>": 773,
      "682</w>": 774,
      "846</w>": 775,
      "843</w>": 776,
      "841</w>": 777,
      "842</w>": 778,
      "987</w>": 779,
      "980</w>": 780,
      "982</w>": 781,
      "277</w>": 782,
      "272</w>": 783,
      "586</w>": 784,
      "583</w>": 785,
      "257</w>": 786,
      "256</w>": 787,
      "259</w>": 788,
      "558</w>": 789,
      "556</w>": 790,
      "554</w>": 791,
      "550</w>": 792,
      "046</w>": 793,
      "049</w>": 794,
      "045</w>": 795,
      "336</w>": 796,
      "333</w>": 797,
      "332</w>": 798,
      "547</w>": 799,
      "548</w>": 800,
      "549</w>": 801,
      "541</w>": 802,
      "542</w>": 803,
      "659</w>": 804,
      "976</w>": 805,
      "975</w>": 806,
      "972</w>": 807,
      "137</w>": 808,
      "131</w>": 809,
      "373</w>": 810,
      "370</w>": 811,
      "437</w>": 812,
      "431</w>": 813,
      "057</w>": 814,
      "052</w>": 815,
      "673</w>": 816,
      "675</w>": 817,
      "X33</w>": 818,
      "X30</w>": 819,
      "940</w>": 820
    },
    "merges": [
      "0 0</w>",
      "1 2",
      "F 12",
      "G 1</w>",
      "F12 00</w>",
      "Y 3</w>",
      "X 3</w>",
      "Y 4</w>",
      "X 2</w>",
      "i t",
      "X 4</w>",
      "Y 2</w>",
      "2 1</w>",
      "9 0</w>",
      "A b",
      "G 21</w>",
      "G 90</w>",
      "S e",
      "e r",
      "e t",
      "i l",
      "i m",
      "i n",
      "i o",
      "l u",
      "l im",
      "m il",
      "n it",
      "n in",
      "o s",
      "o lu",
      "p os",
      "s olu",
      "t e</w>",
      "t o</w>",
      "u nit",
      "it io",
      "Ab solu",
      "Se t</w>",
      "er s</w>",
      "et ers</w>",
      "lim eters</w>",
      "mil limeters</w>",
      "nin g</w>",
      "pos itio",
      "unit s</w>",
      "Absolu te</w>",
      "positio ning</w>",
      "X 1",
      "Y 5</w>",
      "X 5</w>",
      "X 1</w>",
      "6 8</w>",
      "X 2",
      "9 9</w>",
      "Y 1",
      "0 8",
      "2 3",
      "4 8",
      "7 5",
      "7 7",
      "1 8",
      "0 3",
      "1 9</w>",
      "7 8",
      "9 3</w>",
      "0 8</w>",
      "3 4",
      "5 7",
      "8 5",
      "0 4</w>",
      "4 7",
      "6 6</w>",
      "8 7",
      "0 5</w>",
      "1 0</w>",
      "2 4",
      "6 3</w>",
      "7 4",
      "9 2</w>",
      "0 7",
      "1 4</w>",
      "9 5",
      "0 7</w>",
      "1 7</w>",
      "2 6</w>",
      "2 3</w>",
      "4 4",
      "6 3",
      "7 3",
      "0 2</w>",
      "1 2</w>",
      "8 8",
      "3 5",
      "3 8",
      "4 5",
      "8 3",
      "9 8</w>",
      "1 3</w>",
      "2 9</w>",
      "9 3",
      "9 1</w>",
      "0 6</w>",
      "1 4",
      "1 5",
      "1 7",
      "1 5</w>",
      "5 3",
      "6 4",
      "6 8",
      "6 5</w>",
      "8 4",
      "9 8",
      "9 7</w>",
      "X1 0</w>",
      "2 7",
      "2 8",
      "2 5</w>",
      "2 2</w>",
      "5 8",
      "6 7</w>",
      "6 0</w>",
      "6 1</w>",
      "0 3</w>",
      "0 9</w>",
      "1 6</w>",
      "2 5",
      "2 8</w>",
      "5 5",
      "9 6</w>",
      "0 4",
      "1 8</w>",
      "2 7</w>",
      "2 0</w>",
      "3 3",
      "5 4",
      "6 5",
      "9 7",
      "1 3",
      "1 1</w>",
      "3 7",
      "4 3",
      "6 4</w>",
      "6 9</w>",
      "6 2</w>",
      "0 5",
      "9 4</w>",
      "Y 1</w>",
      "X1 6</w>",
      "X1 2</w>",
      "2 4</w>",
      "6 7",
      "X 7</w>",
      "0 1</w>",
      "X 6</w>",
      "Y 6</w>",
      "X1 1</w>",
      "5 68</w>",
      "9 5</w>",
      "X 9</w>",
      "X 21</w>",
      "X1 3</w>",
      "X1 5</w>",
      "0 08</w>",
      "X 3",
      "2 93</w>",
      "9 4",
      "X1 9</w>",
      "X2 2</w>",
      "47 8</w>",
      "0 98</w>",
      "2 10</w>",
      "3 19</w>",
      "5 93</w>",
      "6 99</w>",
      "X 8</w>",
      "Y 0</w>",
      "12 6</w>",
      "X1 7</w>",
      "X1 8</w>",
      "X1 4</w>",
      "X2 6</w>",
      "Y1 3</w>",
      "Y1 1</w>",
      "Y1 2</w>",
      "08 4</w>",
      "48 3</w>",
      "45 8</w>",
      "45 0</w>",
      "1 08</w>",
      "1 14</w>",
      "2 00</w>",
      "2 92</w>",
      "2 20</w>",
      "3 68</w>",
      "3 04</w>",
      "3 02</w>",
      "4 29</w>",
      "6 91</w>",
      "7 00</w>",
      "7 68</w>",
      "7 25</w>",
      "8 99</w>",
      "9 27</w>",
      "08 7</w>",
      "75 4</w>",
      "77 0</w>",
      "77 5</w>",
      "18 6</w>",
      "34 4</w>",
      "34 1</w>",
      "57 3</w>",
      "57 0</w>",
      "57 2</w>",
      "85 3</w>",
      "85 2</w>",
      "87 4</w>",
      "74 2</w>",
      "07 3</w>",
      "95 9</w>",
      "44 8</w>",
      "63 3</w>",
      "88 3</w>",
      "35 2</w>",
      "83 6</w>",
      "93 7</w>",
      "68 4</w>",
      "28 6</w>",
      "58 4</w>",
      "0 99</w>",
      "0 66</w>",
      "0 17</w>",
      "0 22</w>",
      "0 61</w>",
      "1 00</w>",
      "1 65</w>",
      "2 05</w>",
      "2 23</w>",
      "2 16</w>",
      "2 27</w>",
      "2 69</w>",
      "3 93</w>",
      "3 26</w>",
      "3 12</w>",
      "3 61</w>",
      "3 28</w>",
      "4 05</w>",
      "4 23</w>",
      "4 02</w>",
      "5 90</w>",
      "5 63</w>",
      "5 17</w>",
      "5 12</w>",
      "5 60</w>",
      "6 66</w>",
      "6 07</w>",
      "6 02</w>",
      "6 06</w>",
      "7 93</w>",
      "7 92</w>",
      "7 07</w>",
      "7 15</w>",
      "8 00</w>",
      "8 63</w>",
      "8 29</w>",
      "8 28</w>",
      "8 11</w>",
      "9 99</w>",
      "9 04</w>",
      "9 63</w>",
      "9 14</w>",
      "Y 7</w>",
      "Y 8</w>",
      "Y 9</w>",
      "12 8</w>",
      "X2 7</w>",
      "X2 4</w>",
      "08 5</w>",
      "23 8</w>",
      "23 3</w>",
      "23 0</w>",
      "23 1</w>",
      "48 8</w>",
      "48 9</w>",
      "75 8</w>",
      "77 4</w>",
      "77 1</w>",
      "18 7</w>",
      "18 5</w>",
      "03 8</w>",
      "03 4</w>",
      "03 1</w>",
      "78 7</w>",
      "78 9</w>",
      "34 6</w>",
      "47 1</w>",
      "87 9</w>",
      "24 8</w>",
      "24 9</w>",
      "24 5</w>",
      "74 5</w>",
      "95 7</w>",
      "95 6</w>",
      "88 0</w>",
      "35 8</w>",
      "38 8</w>",
      "38 9</w>",
      "17 0</w>",
      "53 5</w>",
      "27 6</w>",
      "28 1</w>",
      "58 9</w>",
      "25 5</w>",
      "13 5</w>",
      "67 0</w>",
      "0 19</w>",
      "0 26</w>",
      "0 12</w>",
      "0 97</w>",
      "0 67</w>",
      "0 09</w>",
      "0 16</w>",
      "0 01</w>",
      "1 05</w>",
      "1 10</w>",
      "1 07</w>",
      "1 06</w>",
      "1 64</w>",
      "2 99</w>",
      "2 04</w>",
      "2 66</w>",
      "2 63</w>",
      "2 14</w>",
      "2 02</w>",
      "2 98</w>",
      "2 06</w>",
      "2 15</w>",
      "2 96</w>",
      "2 62</w>",
      "2 94</w>",
      "2 95</w>",
      "3 08</w>",
      "3 92</w>",
      "3 23</w>",
      "4 68</w>",
      "4 04</w>",
      "4 66</w>",
      "4 92</w>",
      "4 17</w>",
      "4 13</w>",
      "4 91</w>",
      "4 97</w>",
      "4 24</w>",
      "5 99</w>",
      "5 19</w>",
      "5 08</w>",
      "5 23</w>",
      "5 98</w>",
      "5 65</w>",
      "5 67</w>",
      "5 03</w>",
      "6 00</w>",
      "6 63</w>",
      "6 14</w>",
      "6 65</w>",
      "6 25</w>",
      "6 60</w>",
      "6 28</w>",
      "7 19</w>",
      "7 05</w>",
      "7 10</w>",
      "7 23</w>",
      "7 22</w>",
      "7 03</w>",
      "7 18</w>",
      "7 20</w>",
      "7 62</w>",
      "7 01</w>",
      "8 68</w>",
      "8 19</w>",
      "8 04</w>",
      "8 05</w>",
      "8 14</w>",
      "8 26</w>",
      "8 97</w>",
      "8 03</w>",
      "8 20</w>",
      "9 68</w>",
      "9 19</w>",
      "9 66</w>",
      "9 05</w>",
      "9 07</w>",
      "9 17</w>",
      "9 26</w>",
      "9 29</w>",
      "9 67</w>",
      "9 09</w>",
      "9 11</w>",
      "Y 21</w>",
      "12 0</w>",
      "X2 3</w>",
      "Y1 5</w>",
      "08 3</w>",
      "08 9</w>",
      "08 0</w>",
      "23 6</w>",
      "23 9</w>",
      "48 7</w>",
      "48 6</w>",
      "48 5</w>",
      "75 3</w>",
      "75 0</w>",
      "75 5</w>",
      "75 1</w>",
      "75 2</w>",
      "77 3</w>",
      "18 8</w>",
      "18 4</w>",
      "18 0</w>",
      "18 2</w>",
      "03 7</w>",
      "03 3</w>",
      "03 9</w>",
      "78 3</w>",
      "78 4</w>",
      "78 1</w>",
      "78 2</w>",
      "34 0</w>",
      "57 4</w>",
      "85 6</w>",
      "85 0</w>",
      "85 1</w>",
      "47 6</w>",
      "47 4</w>",
      "87 7</w>",
      "87 6</w>",
      "87 5</w>",
      "24 3</w>",
      "24 4</w>",
      "24 0</w>",
      "74 7</w>",
      "74 4</w>",
      "07 7</w>",
      "07 9</w>",
      "07 1</w>",
      "07 2</w>",
      "95 1</w>",
      "44 7</w>",
      "44 9</w>",
      "44 5</w>",
      "63 6</w>",
      "63 0</w>",
      "63 5</w>",
      "73 7</w>",
      "73 8</w>",
      "73 9</w>",
      "73 0</w>",
      "73 5</w>",
      "88 6</w>",
      "35 3</w>",
      "38 3</w>",
      "38 0</w>",
      "83 8</w>",
      "83 3</w>",
      "83 2</w>",
      "93 5</w>",
      "14 8</w>",
      "14 4</w>",
      "15 4</w>",
      "15 2</w>",
      "17 4</w>",
      "53 6</w>",
      "53 0</w>",
      "64 6</w>",
      "64 4</w>",
      "64 9</w>",
      "64 5</w>",
      "68 6</w>",
      "84 0</w>",
      "84 5</w>",
      "98 6</w>",
      "98 9</w>",
      "98 1</w>",
      "27 3</w>",
      "27 4</w>",
      "27 9</w>",
      "28 7</w>",
      "25 8</w>",
      "55 3</w>",
      "55 9</w>",
      "04 7</w>",
      "04 0</w>",
      "33 8</w>",
      "33 1</w>",
      "54 0</w>",
      "65 3</w>",
      "65 4</w>",
      "65 2</w>",
      "97 7</w>",
      "97 8</w>",
      "13 3</w>",
      "37 7</w>",
      "37 4</w>",
      "43 2</w>",
      "05 0</w>",
      "67 6</w>",
      "0 21</w>",
      "0 90</w>",
      "0 10</w>",
      "0 07</w>",
      "0 02</w>",
      "0 13</w>",
      "0 29</w>",
      "0 06</w>",
      "0 15</w>",
      "0 03</w>",
      "0 96</w>",
      "0 18</w>",
      "0 27</w>",
      "0 69</w>",
      "1 90</w>",
      "1 93</w>",
      "1 04</w>",
      "1 66</w>",
      "1 63</w>",
      "1 92</w>",
      "1 17</w>",
      "1 98</w>",
      "1 13</w>",
      "1 91</w>",
      "1 97</w>",
      "1 60</w>",
      "1 03</w>",
      "1 09</w>",
      "1 16</w>",
      "1 18</w>",
      "2 90</w>",
      "2 19</w>",
      "2 07</w>",
      "2 26</w>",
      "2 12</w>",
      "2 13</w>",
      "2 25</w>",
      "2 22</w>",
      "2 61</w>",
      "2 09</w>",
      "2 28</w>",
      "3 00</w>",
      "3 90</w>",
      "3 99</w>",
      "3 06</w>",
      "3 60</w>",
      "3 96</w>",
      "3 24</w>",
      "3 95</w>",
      "4 21</w>",
      "4 90</w>",
      "4 99</w>",
      "4 19</w>",
      "4 10</w>",
      "4 12</w>",
      "4 65</w>",
      "4 25</w>",
      "4 60</w>",
      "4 96</w>",
      "4 64</w>",
      "4 62</w>",
      "4 94</w>",
      "4 95</w>",
      "5 00</w>",
      "5 21</w>",
      "5 66</w>",
      "5 05</w>",
      "5 92</w>",
      "5 26</w>",
      "5 29</w>",
      "5 61</w>",
      "5 09</w>",
      "5 16</w>",
      "5 28</w>",
      "5 64</w>",
      "6 68</w>",
      "6 19</w>",
      "6 10</w>",
      "6 92</w>",
      "6 26</w>",
      "6 23</w>",
      "6 13</w>",
      "6 97</w>",
      "6 62</w>",
      "6 94</w>",
      "6 95</w>",
      "7 08</w>",
      "7 04</w>",
      "7 66</w>",
      "7 63</w>",
      "7 14</w>",
      "7 17</w>",
      "7 26</w>",
      "7 13</w>",
      "7 65</w>",
      "7 97</w>",
      "7 67</w>",
      "7 61</w>",
      "7 69</w>",
      "7 94</w>",
      "7 24</w>",
      "8 07</w>",
      "8 17</w>",
      "8 23</w>",
      "8 91</w>",
      "8 25</w>",
      "8 22</w>",
      "8 96</w>",
      "8 18</w>",
      "8 64</w>",
      "9 21</w>",
      "9 93</w>",
      "9 92</w>",
      "9 02</w>",
      "9 13</w>",
      "9 91</w>",
      "9 06</w>",
      "9 15</w>",
      "9 65</w>",
      "9 97</w>",
      "9 22</w>",
      "9 60</w>",
      "9 16</w>",
      "9 96</w>",
      "9 18</w>",
      "Y 22</w>",
      "12 4</w>",
      "12 9</w>",
      "X2 8</w>",
      "X2 9</w>",
      "X2 0</w>",
      "X2 5</w>",
      "Y1 7</w>",
      "Y1 6</w>",
      "Y1 9</w>",
      "Y1 0</w>",
      "08 8</w>",
      "08 6</w>",
      "23 7</w>",
      "23 5</w>",
      "23 2</w>",
      "48 0</w>",
      "48 1</w>",
      "75 7</w>",
      "75 6</w>",
      "77 8</w>",
      "77 6</w>",
      "77 2</w>",
      "18 1</w>",
      "03 6</w>",
      "03 0</w>",
      "78 8</w>",
      "78 6</w>",
      "78 5</w>",
      "34 7</w>",
      "34 3</w>",
      "34 9</w>",
      "57 8</w>",
      "57 1</w>",
      "85 4</w>",
      "85 9</w>",
      "85 5</w>",
      "47 3</w>",
      "47 9</w>",
      "47 0</w>",
      "87 3</w>",
      "87 1</w>",
      "87 2</w>",
      "74 8</w>",
      "74 6</w>",
      "74 0</w>",
      "07 8</w>",
      "07 4</w>",
      "95 4</w>",
      "95 2</w>",
      "44 6</w>",
      "44 4</w>",
      "44 1</w>",
      "63 7</w>",
      "63 1</w>",
      "73 6</w>",
      "73 3</w>",
      "73 1</w>",
      "88 7</w>",
      "88 5</w>",
      "88 1</w>",
      "35 4</w>",
      "35 1</w>",
      "38 5</w>",
      "38 2</w>",
      "45 6</w>",
      "83 0</w>",
      "93 6</w>",
      "93 4</w>",
      "93 9</w>",
      "93 0</w>",
      "14 7</w>",
      "14 9</w>",
      "14 1</w>",
      "14 2</w>",
      "15 8</w>",
      "15 6</w>",
      "15 3</w>",
      "15 9</w>",
      "15 1</w>",
      "17 8</w>",
      "17 5</w>",
      "17 1</w>",
      "53 9</w>",
      "53 2</w>",
      "64 8</w>",
      "64 2</w>",
      "68 7</w>",
      "68 0</w>",
      "68 5</w>",
      "68 2</w>",
      "84 6</w>",
      "84 3</w>",
      "84 1</w>",
      "84 2</w>",
      "98 7</w>",
      "98 0</w>",
      "98 2</w>",
      "27 7</w>",
      "27 2</w>",
      "58 6</w>",
      "58 3</w>",
      "25 7</w>",
      "25 6</w>",
      "25 9</w>",
      "55 8</w>",
      "55 6</w>",
      "55 4</w>",
      "55 0</w>",
      "04 6</w>",
      "04 9</w>",
      "04 5</w>",
      "33 6</w>",
      "33 3</w>",
      "33 2</w>",
      "54 7</w>",
      "54 8</w>",
      "54 9</w>",
      "54 1</w>",
      "54 2</w>",
      "65 9</w>",
      "97 6</w>",
      "97 5</w>",
      "97 2</w>",
      "13 7</w>",
      "13 1</w>",
      "37 3</w>",
      "37 0</w>",
      "43 7</w>",
      "43 1</w>",
      "05 7</w>",
      "05 2</w>",
      "67 3</w>",
      "67 5</w>",
      "X3 3</w>",
      "X3 0</w>",
      "94 0</w>"
    ]
  }
}